presentations/pres_2.tex
% Created 2012-09-23 Sun 23:20
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Pony: Evolving Languages Without (as many) Bugs}
\author{Andrew Hirsch}
\date{\today}

\begin{document}

\maketitle



\section{Introduction}
\label{sec-1}
\begin{frame}
\frametitle{Introduction}
\label{sec-1-1}



\begin{itemize}
\item Pony is an \emph{extensible compiler} for C
\item Add features to C
\item Think of slang words: we say ``lol''
\begin{itemize}
\item We don't actually say that we laugh
\item We don't write out our laughter
\end{itemize}
\end{itemize}
\end{frame}
\section{Change Your Language, Not Your Thoughts}
\label{sec-2}
\begin{frame}
\frametitle{Changing Your Thoughts}
\label{sec-2-1}



\begin{itemize}
\item Traditional Languages require that you change your thoughts to fit the language
\begin{itemize}
\item I.e. to write a mathematical function in C, one has to change it to imperative form
\item I.e. to write a subtype in Haskell, one has to understand \verb~Monads~ and \verb~Kinds~.
\end{itemize}
\item This can be very confusing!
\end{itemize}
  
\end{frame}
\begin{frame}
\frametitle{Change Your Language}
\label{sec-2-2}



\begin{itemize}
\item Instead of changing thoughts, we should change languages!
\item Pony allows us to change C
\begin{itemize}
\item For data structures, add objects
\item For mathematical functions, add features like function composition
\item Add syntactic sugar for features, to add standard notation to C
\begin{itemize}
\item I.e. [1, 2, 3] for the linked list containing 1, 2, and 3
\end{itemize}
\end{itemize}
\end{itemize}
\end{frame}
\section{Bugs In Transformed Language}
\label{sec-3}
\begin{frame}
\frametitle{Multiple Extensions}
\label{sec-3-1}


\begin{itemize}
\item Most programs involve more than one algorithm
\begin{itemize}
\item Hence, more than one extension makes sense
\end{itemize}
\item However, extensions might use the same syntax
\begin{itemize}
\item If [1, 2, 3] is both a linked list and a javascript-style (prototype-based) object, which should the compiler use?
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Collision Detection}
\label{sec-3-2}



\begin{itemize}
\item We have termed detecting this problem \emph{Collision Detection}
\item Over a single piece of code, there are ways to tell if there is collision
\begin{itemize}
\item I.e. trans1 \(\circ\) trans2 \(\overset{?}{=}\) trans2 \(\circ\) trans1
\end{itemize}
\item However, is it possible to tell if two transformations will \underline{never} collide?
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Difficulty}
\label{sec-3-3}



\begin{itemize}
\item We have devised a high-level algorithm for detecting collision detection
\item However, in the general case, it is not possible to perfectly detect collision
\item Our algorithm is too conservative
\begin{itemize}
\item If there is any possibility that two transformations won't work together, we reject it
\end{itemize}
\end{itemize}
\end{frame}
\section{Conclusion}
\label{sec-4}
\begin{frame}
\frametitle{Productivity for practitioners}
\label{sec-4-1}



\begin{itemize}
\item Pony is a useful tools for developers everywhere
\begin{itemize}
\item Pony can make developers more productive
\item It may also help reduce bugs in code, by making the ``thought to code'' process easier
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Contributions to the scientific conversation}
\label{sec-4-2}



\begin{itemize}
\item Pony contributes to a scientific conversation
\begin{itemize}
\item Extensible parsers have not been written in pure functional ways before
\item Collision detection is new, and has not been attempted in our general framework
\item These contribute to our understanding of the limits of extensible languages
\end{itemize}
\end{itemize}
\end{frame}

\end{document}
